Nitin-Flavier13/STM32F407xx_Projects/CAN_Receiver/Src/main.c
/**
 ******************************************************************************
 * @file           : main.c
 * @author         : Auto-generated by STM32CubeIDE
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2023 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */

#include <stdint.h>
#include <stm32f4xx.h>

uint8_t value;

void Set_Pin(void)
{
    RCC->AHB1ENR |= (1<<1);

    GPIOB->MODER |= (0xA << 16);          // Alternate functionality mode

    GPIOB->AFR[1] |= (0x9 | (0x9<<4));    // AF9 for PB8 , PB9 pins
}

uint8_t CAN_Rx(void)
{
    while(!(CAN1->RF0R & 3));   // waiting for atleast one message

    uint8_t data = (CAN1->sFIFOMailBox[0].RDLR) & 0xFF; // only 1 byte
 
    CAN1->RF0R |= (1<<5);  // Release FIFO MailBox
    
    return data;
}

void CAN_Init(void)
{
    RCC->APB1ENR |= 1<<25;   // CAN1 Initialize

    CAN1->MCR |= (1<<0);     // Enter into Initialization mode
    while(!(CAN1->MSR & 0x1));   // wait until INAK bit is set

    /* Exit Sleep Mode */
	CAN1->MCR &= ~(1<<1);
	while(CAN1->MSR & 0X2);     // SLAK Sleep ACK

    CAN1->BTR &= ~(3<<24);      // SWJ 1 Time Quantum

    CAN1->BTR &= ~(0x7F << 16);

    CAN1->BTR |= (12 << 16);    // Time Segment 1
    CAN1->BTR |= (1 << 20);     // Time Segment 2

    CAN1->BTR |= (7 << 0);      // Baud-Rate Prescaler

    /* Exit Initialization mode */
    CAN1->MCR &= ~(1<<0);
    while(CAN1->MSR & 0x1);



    /* Filter Configuration */

    CAN1->FMR |= 1<<0;   // Initialise filter mode

    CAN1->FMR |= 14<<8;  // they define start bank for CAN2

    CAN1->FS1R |= 1<<13;  // 32 bit scale configuration Filter

    // Filtering it with respect to the ID

    CAN1->FM1R |= (1<<13);   // Identifier List-Mode
    
    CAN1->sFilterRegister[13].FR1 = 138 << 21;   // STD ID

    CAN1->FA1R |= (1<<13);

    CAN1->FMR &= ~(0x1);

}

void delay(uint32_t d)
{
    for(uint32_t i=0;i<d*1000;i++);
}

int main(void)
{
    /* Loop forever */
	Set_Pin();
	CAN_Init();
	while(1)
	{
		value = CAN_Rx();
		delay(100);
	}

}
